In [1]:
import numpy as np
import pandas as pd

In [2]:
dic1={
    "Name":['ANIRBAN','SOURIN','RITESH','ARKHA','AYAN','SUBHADEEP','SUMAN'],
    "Age" :[19,20,20,21,22,20,19],
    "City":['BURDWAN','BANKURA','BEHALA','BARUIPUR','DURGAPUR','HALDIA','DURGAPUR']
}

In [3]:
dic1

{'Name': ['ANIRBAN',
  'SOURIN',
  'RITESH',
  'ARKHA',
  'AYAN',
  'SUBHADEEP',
  'SUMAN'],
 'Age': [19, 20, 20, 21, 22, 20, 19],
 'City': ['BURDWAN',
  'BANKURA',
  'BEHALA',
  'BARUIPUR',
  'DURGAPUR',
  'HALDIA',
  'DURGAPUR']}

In [4]:
df=pd.DataFrame(dic1)

In [5]:
df

        Name  Age      City
0    ANIRBAN   19   BURDWAN
1     SOURIN   20   BANKURA
2     RITESH   20    BEHALA
3      ARKHA   21  BARUIPUR
4       AYAN   22  DURGAPUR
5  SUBHADEEP   20    HALDIA
6      SUMAN   19  DURGAPUR

In [6]:
df.head(2)

      Name  Age     City
0  ANIRBAN   19  BURDWAN
1   SOURIN   20  BANKURA

In [7]:
df.tail(2)

        Name  Age      City
5  SUBHADEEP   20    HALDIA
6      SUMAN   19  DURGAPUR

In [8]:
df.to_csv('first_data.csv')

In [9]:
df.to_csv('indexFalse.csv',index=False)

In [10]:
df.describe()

             Age
count   7.000000
mean   20.142857
std     1.069045
min    19.000000
25%    19.500000
50%    20.000000
75%    20.500000
max    22.000000

In [11]:
importing=pd.read_csv('rahul.csv')
# There is a problem with csv file

In [12]:
importing

     Name  Job  Exp.
0    Anil  CSE     1
1   Rahul  ECE     2
2  Sushil   EE     3
3   Nitin   CE     4
4  Nitesh   EE     5

In [13]:
importing.describe()

           Exp.
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [14]:
importing['Name'][0]

'Anil'

In [15]:
importing['Name'][2]

'Sushil'

In [16]:
importing['Job'][0]

'CSE'

In [17]:
importing.index=['first','second','third','fourth','fifth']

In [18]:
importing

          Name  Job  Exp.
first     Anil  CSE     1
second   Rahul  ECE     2
third   Sushil   EE     3
fourth   Nitin   CE     4
fifth   Nitesh   EE     5

In [19]:
importing['Name']

first       Anil
second     Rahul
third     Sushil
fourth     Nitin
fifth     Nitesh
Name: Name, dtype: object

In [22]:
ser=pd.Series(np.random.rand(35))

In [23]:
ser

0     0.613482
1     0.858982
2     0.943061
3     0.587860
4     0.662505
5     0.705028
6     0.220809
7     0.375100
8     0.159844
9     0.845461
10    0.193978
11    0.515315
12    0.089531
13    0.119397
14    0.635647
15    0.061306
16    0.271939
17    0.862619
18    0.899202
19    0.292004
20    0.177073
21    0.612840
22    0.667430
23    0.662135
24    0.361990
25    0.766409
26    0.969323
27    0.012790
28    0.645635
29    0.769271
30    0.043922
31    0.770257
32    0.748880
33    0.691370
34    0.953210
dtype: float64

In [24]:
type(ser)

pandas.core.series.Series

In [28]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))